In [3]:
import pandas as pd
data= {'country':['Belgium','France','Germany','Netherlands','UK'],
      'population':[11.3,64.3,81.3,16.9,64.9],
      'area':[30510,671308,357050,41256,244820],
      'capital':['Brussels','Paris','Berlin','Amsterdam','London']}

In [4]:
#create a dataframe
countries=pd.DataFrame(data)
countries.head()

       country  population    area    capital
0      Belgium        11.3   30510   Brussels
1       France        64.3  671308      Paris
2      Germany        81.3  357050     Berlin
3  Netherlands        16.9   41256  Amsterdam
4           UK        64.9  244820     London

In [6]:
#print only population
population= countries['population']
population

0    11.3
1    64.3
2    81.3
3    16.9
4    64.9
Name: population, dtype: float64

In [7]:
#multiply the population with 1000
population * 1000

0    11300.0
1    64300.0
2    81300.0
3    16900.0
4    64900.0
Name: population, dtype: float64

In [8]:
population>50

0    False
1     True
2     True
3    False
4     True
Name: population, dtype: bool

In [9]:
population/countries['area']

0    0.000370
1    0.000096
2    0.000228
3    0.000410
4    0.000265
dtype: float64

In [10]:
#added in your data frame as new column
countries['population_density']= population/countries['area'] * 1e6

In [11]:
countries

       country  population    area    capital  population_density
0      Belgium        11.3   30510   Brussels          370.370370
1       France        64.3  671308      Paris           95.783158
2      Germany        81.3  357050     Berlin          227.699202
3  Netherlands        16.9   41256  Amsterdam          409.637386
4           UK        64.9  244820     London          265.092721

In [12]:
#Average Population
population.mean()

47.739999999999995

In [13]:
#get minimum area:
countries['area'].min()

30510

In [15]:
#Dataframe we get a series of one values for each column
#if you have mixed type of Data and you want to calculatre the median of numerics columns
countries.median(numeric_only=True)

population                64.300000
area                  244820.000000
population_density       265.092721
dtype: float64

In [17]:
#work with Real dataSet
#Download the rowdata
#Basic Data exploration

#load dataset into dataframe # read CSV file
df= pd.read_csv("files/titanic.csv")
#check first five records
df.head()
#check the length of your data frame

#Q-1 what is the average age of the Passengers?
#Q-2 What is the survival Rate? (relative number of people that survived) / 1- survived & 0-not
#Q-3 What is the Maximum Fare? and the Median?
#Q-4 Calculate Scaled Fares (Scaled relatives to its mean)
#add this to a new column named 'Fare_scaled' to Dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
#check length
len(df)

891

In [20]:
df['Age'].mean()

29.69911764705882

In [21]:
#total no of survived
df['Survived'].sum()

342

In [22]:
df['Survived'].sum() / len(df['Survived'])

0.3838383838383838

In [23]:
df['Survived'].mean()

0.3838383838383838

In [24]:
df['Fare'].max()

512.3292

In [25]:
df['Fare'].median()

14.4542

In [26]:
df['Fare'] / df['Fare'].mean()

0      0.225126
1      2.213478
2      0.246086
3      1.648853
4      0.249967
         ...
886    0.403674
887    0.931555
888    0.728166
889    0.931555
890    0.240652
Name: Fare, Length: 891, dtype: float64

In [27]:
df['Fare_scaled']=df['Fare'] / df['Fare'].mean()

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_scaled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.225126
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2.213478
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.246086
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.648853
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.249967

In [33]:
#select all rows for male passengers and calculate the mean of those
males= df[df['Sex']== 'male']
males['Age'].mean()

30.72664459161148

In [35]:
# do the same for female passengers too.
df[df['Sex']== 'female']['Age'].mean()

27.915708812260537

In [37]:
#Howmany passengers are older than 70?
len(df[df['Age']>70])

5

In [38]:
(df['Age']>70).sum()

5

In [ ]:
#select the passengers between 30 to 40 years old